Revit 2024 API
ZoneEquipmentData Methods
The ZoneEquipmentData type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsDataCompleted
 Is the required data completed for this zone equipment?
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace